import React from "react";

export default function Terms() {
  return (
    <div className="flex gap-2 flex-col">
      <p>
        1. 趨勢科技股份有限公司（以下稱本公司）向您蒐集之個人資料，及處理、使用您的個人資料皆依個人資料保護法及相關法令之規範辦理。
      </p>
      <p>
        2. 本次蒐集之個人資料包含姓名、任職單位、email address等得以直接或間接識別個人之相關資訊。本公司蒐集、處理及使用您的個人資料，目的在於供本公司及本公司之母子公司進行數據統計等招募徵才、及程式競賽等相關工作之用，期限自取得起始日至前述特定目的的終止日為止，並遵守個人資料保護法之規定妥善保護您的個人資訊。
      </p>
      <p>
        3. 您同意本公司因前項所定目的所需，以您所提供的個人資料與您進行聯絡。
      </p>
      <p>
        4. 您可依個人資料保護法，就您的個人資料向本公司請求：查詢或閱覽、製給複製本、補充或更正、停止蒐集、處理及利用、或請求刪除。但因本公司執行職務或業務所必需者及受其他法律所規範者，本公司得拒絕之。
      </p>
      <p>5. 本同意書如有未盡事宜，依個人資料保護法或其他相關法規之規定辦理。</p>
      <p>
        6. 您瞭解此一同意書符合個人資料保護法及相關法規之要求，並具有書面同意本公司蒐集、處理及使用您的個人資料之效果。
      </p>
    </div>
  );
}